; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 948235 2 1 3 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	image2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	Star0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(have_image Phenomenon5 image2)
	(have_image Star6 thermograph1)
	(have_image Star7 spectrograph0)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star3)
   goals met: 0 of 6
4. (turn_to satellite1 star7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star7)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 star0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star0)
   goals met: 0 of 6
7. (turn_to satellite0 phenomenon5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon5)
   goals met: 0 of 6
8. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (take_image satellite0 phenomenon5 instrument0 image2)
   added: (have_image phenomenon5 image2)
   goals met: 1 of 6
10. (turn_to satellite1 star7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star7)
   goals met: 1 of 6
11. (take_image satellite1 star7 instrument1 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 2 of 6
12. (turn_to satellite1 star6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star6)
   goals met: 2 of 6
13. (take_image satellite1 star6 instrument1 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 3 of 6
14. (turn_to satellite1 planet8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet8)
   goals met: 3 of 6
15. (take_image satellite1 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 4 of 6
16. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 6
17. (take_image satellite1 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 5 of 6
18. (turn_to satellite1 star10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star10)
   goals met: 5 of 6
19. (take_image satellite1 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 6 of 6
